my-calculator-web-service/src/main/resources/xml/soap-request-add_2_2.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
    </soap:Header>
    <soap:Body>
        <p:CalculatorRQ xmlns:p="http://services.bawi.com/calculator" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xsi:schemaLocation="http://services.bawi.com/calculator calculator.xsd ">
            <parameters>2</parameters>
            <parameters>2</parameters>
            <operation>ADD</operation>
        </p:CalculatorRQ>
    </soap:Body>
</soap:Envelope>